# DATA SCIENCE SESSIONS VOL. 3
### A Foundational Python Data Science Course
## Session 10 - part 2: Relational Databases and Pandas 

[&larr; Back to course webpage](https://datakolektiv.com/)

Feedback should be send to [goran.milovanovic@datakolektiv.com](mailto:goran.milovanovic@datakolektiv.com). 

These notebooks accompany the DATA SCIENCE SESSIONS VOL. 3 :: A Foundational Python Data Science Course.

![](../img/IntroRDataScience_NonTech-1.jpg)

### Lecturers

[Goran S. Milovanović, PhD, DataKolektiv, Chief Scientist & Owner](https://www.linkedin.com/in/gmilovanovic/)

[Aleksandar Cvetković, PhD, DataKolektiv, Consultant](https://www.linkedin.com/in/alegzndr/)

[Ilija Lazarević, MA, DataKolektiv, Consultant](https://www.linkedin.com/in/ilijalazarevic/)

![](../img/DK_Logo_100.png)

***

## Relational Databases

Relational database is a way of organizing (designing) data into tables where each table is in some way related to the other(s). This is where the 'relational' part is comming from. Plain and simple! 

But what is a database? In general, a database is a way of organizing the data. Relational database is just one of many types of databases.  

Database management system is a software that provides service for storing, updating, and retrieving the data from the database. Additionally, it provides many functionalities that make your life as user, a pleasant experience. There are functionalities that are particularly exposed to the special type of users called **DBA** (*Database Administrator*). These special functionalities are mostly non of the concern for regular users who want to perform **CRUD** (*Create, Read, Update, Delete*) operations. Yet, for any serious use of databases, you need an administrator. 

Since there are many types of databases, when we talk about relational ones, we talk about RDBMS (*Relational Database Management System*). **MariaDB** is one of these. Some others that you may have heard are *Oracle*, *Postgres*, *AcessDB*, *MySQL*, *SQLite*, *MongoDB*, *ElasticSearch*, etc. Some are relational, some are non-relational. Which one you are going to use reallly boils down to the business requirements and use cases.

Relational approach to designing databases was invented in 1970s, but **Edgar Frank "Ted" Codd**. Previously used hierarchical and network databases had cons outweighting the pros in regard to modern times and modern use cases. This is where relational databases came and excelled. Along with the relational database design came a need to standardize a way of dealing with data in database system. This is when **SEQUEL** (*Structured English Query Language*) language was invented. However, it was shortly renamed to **SQL** (*Structured Query Language*). This is what we will be using later. Anyway, because SQL was so popular it became a synonum for relational databases. So much that non-relational databases are also called **NoSQL** databases.

In this session we will be using **MariaDB** as RDBMS, and **SQL** to query data from the database and tables you hopefully have created by now.

Because we are going to introduce a new language and a ways of querying and processing the data, we have decided to use alredy known NYC Flights data set. You are already familiar with it, so we can solely focus on learning new concepts.

Alright then, let's start.

In [1]:
import pandas as pd

from sqlalchemy import create_engine
from sqlalchemy import text as sql_text

Let's quickly load our data from CSV files into Pandas DataFrames, for later comparisons. Nothing new here.

In [2]:
df_airlines = pd.read_csv('_data/airlines.csv', index_col=0)
df_flights = pd.read_csv('_data/flights.csv', index_col=0)
df_weather = pd.read_csv('_data/weather.csv', index_col=0)
df_airports = pd.read_csv('_data/airports.csv', index_col=0)

In [3]:
df_airlines.shape, df_flights.shape, df_weather.shape, df_airports.shape

((16, 2), (336776, 19), (26115, 15), (1458, 8))

Like we said, **MariaDB** is a RDBMS, and you can view it a as program that runs on your host. Since it runs without particular window, you will not be able to "see" it, but it still runs. Because you mostly work with windows, be it Windows, MacOS, Linux or any other, you are acustomed to User Interface (UI). Because this program runs "invisibly" we need a way of communicating with it. Since program is "listening" on a specific address and port, we have to specify this "full address" if we are to connect to it. This "full address" is specified in the next string.

In [4]:
CONNECTION_STRING = 'mysql+mysqlconnector://datakolektiv:datakolektiv123@localhost/nycflights'

Now we have to create an `Engine` object that will know how to speak with our database. It will give us ability to connect to our database and "speak" with it.

In [5]:
# MariaDB is a successor of the MySQL 
# and that is the reason why you will see
# we use mysql when connecting to the 
# database.
engine = create_engine(CONNECTION_STRING) # use this as is

Since there are couple of steps when "talking" with the database, we will hide them behing this helper function.

In [6]:
def query_database(query: str, chunked: bool = False) -> pd.DataFrame:
    conn = engine.connect()  # necessary to start querying the database
    chunk_size = 10_000 if chunked is True else None
    df = pd.read_sql_query(sql=sql_text(query), con=conn, chunksize=chunk_size)
    conn.close()  # necessary to say that you are finished with querying
    return df

You already did test database in the preparation notebook for this session. However, let's test it once more.

In [7]:
query_database('SELECT * FROM flights LIMIT 10')

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 05:00:00
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 05:00:00
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 05:00:00
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 05:00:00
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 06:00:00
5,2013,1,1,554.0,558,-4.0,740.0,728,12.0,UA,1696,N39463,EWR,ORD,150.0,719,5,58,2013-01-01 05:00:00
6,2013,1,1,555.0,600,-5.0,913.0,854,19.0,B6,507,N516JB,EWR,FLL,158.0,1065,6,0,2013-01-01 06:00:00
7,2013,1,1,557.0,600,-3.0,709.0,723,-14.0,EV,5708,N829AS,LGA,IAD,53.0,229,6,0,2013-01-01 06:00:00
8,2013,1,1,557.0,600,-3.0,838.0,846,-8.0,B6,79,N593JB,JFK,MCO,140.0,944,6,0,2013-01-01 06:00:00
9,2013,1,1,558.0,600,-2.0,753.0,745,8.0,AA,301,N3ALAA,LGA,ORD,138.0,733,6,0,2013-01-01 06:00:00

### SQL Language

Like we said in introduction part, we need a way to talk with database. A language to say. This language is SQL. SQL, like any other programming language has it's own syntax. We will go thorugh the examples of querying database and also display how we can achieve same thing, or at least similar, in Pandas.

In [8]:
query_database('SELECT * FROM airlines')

   carrier                         name
0       9E            Endeavor Air Inc.
1       AA       American Airlines Inc.
2       AS         Alaska Airlines Inc.
3       B6              JetBlue Airways
4       DL         Delta Air Lines Inc.
5       EV     ExpressJet Airlines Inc.
6       F9       Frontier Airlines Inc.
7       FL  AirTran Airways Corporation
8       HA       Hawaiian Airlines Inc.
9       MQ                    Envoy Air
10      OO        SkyWest Airlines Inc.
11      UA        United Air Lines Inc.
12      US              US Airways Inc.
13      VX               Virgin America
14      WN       Southwest Airlines Co.
15      YV           Mesa Airlines Inc.

All of our queries will start with keyword `SELECT`. By this we are saying that we want to read the data. Then, there is the `FROM` keyword followed by the table name, that says where are we reading the data from. `*` is part where we "select" all columns data to be present in the query result. This part where we select what do we want to appear in the query result is very interesting, as we shall see. For now, know that we can select all columns (`*`) or specific ones by specifying each column's name.

Let's go through some simple examples of querying our tables.

Retrieve all columns and rows from table airlines ordered by name ascendingly.

In [9]:
query_database('SELECT * FROM airlines ORDER BY name ASC')

# Pandas way
# df_airlines.sort_values(by='name', ascending=True)

   carrier                         name
0       FL  AirTran Airways Corporation
1       AS         Alaska Airlines Inc.
2       AA       American Airlines Inc.
3       DL         Delta Air Lines Inc.
4       9E            Endeavor Air Inc.
5       MQ                    Envoy Air
6       EV     ExpressJet Airlines Inc.
7       F9       Frontier Airlines Inc.
8       HA       Hawaiian Airlines Inc.
9       B6              JetBlue Airways
10      YV           Mesa Airlines Inc.
11      OO        SkyWest Airlines Inc.
12      WN       Southwest Airlines Co.
13      UA        United Air Lines Inc.
14      US              US Airways Inc.
15      VX               Virgin America

How about we select all rows but only *carrier* column, and still keep rows sorted ascendingly by the *name* column?

In [10]:
query_database('SELECT carrier FROM airlines ORDER BY name ASC')

# Pandas way
# df_airlines.sort_values(by='name', ascending=True).loc[:, ['carrier']]

   carrier
0       FL
1       AS
2       AA
3       DL
4       9E
5       MQ
6       EV
7       F9
8       HA
9       B6
10      YV
11      OO
12      WN
13      UA
14      US
15      VX

We can also select both columns, explicitly. It is easier to use `*` instead of explicit column names, particularly when there is a lot of columns and you need them all. Nevertheless, it may be helpful for ones reading your SQL query to know what will be the result without looking at the result itself.

In [11]:
query_database('SELECT carrier, name FROM airlines ORDER BY name ASC')

# Pandas way
# df_airlines.sort_values(by='name', ascending=True)

   carrier                         name
0       FL  AirTran Airways Corporation
1       AS         Alaska Airlines Inc.
2       AA       American Airlines Inc.
3       DL         Delta Air Lines Inc.
4       9E            Endeavor Air Inc.
5       MQ                    Envoy Air
6       EV     ExpressJet Airlines Inc.
7       F9       Frontier Airlines Inc.
8       HA       Hawaiian Airlines Inc.
9       B6              JetBlue Airways
10      YV           Mesa Airlines Inc.
11      OO        SkyWest Airlines Inc.
12      WN       Southwest Airlines Co.
13      UA        United Air Lines Inc.
14      US              US Airways Inc.
15      VX               Virgin America

Let's do similar thing but now sort rows by *carrier* column descendingly.

In [12]:
query_database('SELECT * FROM airlines ORDER BY carrier DESC')

# Pandas way
# df_airlines.sort_values(by='carrier', ascending=False)

   carrier                         name
0       YV           Mesa Airlines Inc.
1       WN       Southwest Airlines Co.
2       VX               Virgin America
3       US              US Airways Inc.
4       UA        United Air Lines Inc.
5       OO        SkyWest Airlines Inc.
6       MQ                    Envoy Air
7       HA       Hawaiian Airlines Inc.
8       FL  AirTran Airways Corporation
9       F9       Frontier Airlines Inc.
10      EV     ExpressJet Airlines Inc.
11      DL         Delta Air Lines Inc.
12      B6              JetBlue Airways
13      AS         Alaska Airlines Inc.
14      AA       American Airlines Inc.
15      9E            Endeavor Air Inc.

But what if the desired colum name is not to your liking? Can we change it in SQL? Yes!

In [13]:
query_database('SELECT carrier AS airline_code, name as airline_name FROM airlines')

   airline_code                 airline_name
0            9E            Endeavor Air Inc.
1            AA       American Airlines Inc.
2            AS         Alaska Airlines Inc.
3            B6              JetBlue Airways
4            DL         Delta Air Lines Inc.
5            EV     ExpressJet Airlines Inc.
6            F9       Frontier Airlines Inc.
7            FL  AirTran Airways Corporation
8            HA       Hawaiian Airlines Inc.
9            MQ                    Envoy Air
10           OO        SkyWest Airlines Inc.
11           UA        United Air Lines Inc.
12           US              US Airways Inc.
13           VX               Virgin America
14           WN       Southwest Airlines Co.
15           YV           Mesa Airlines Inc.

Nice. To bad you can't query Pandas DataFrames with SQL, right? Wrong. Apparently, there is an initiative for doing exactly this. Check [it](https://fugue-tutorials.readthedocs.io/index.html) out!

What if we want to filter rows by some condition? Here in our table we only have columns of type string. Let's fetch only rows where *carrier* is equal to 'AA'.

In [14]:
query_database('SELECT * FROM airlines WHERE carrier = "AA"')

  carrier                    name
0      AA  American Airlines Inc.

What if we want to take all rows where *carrier* starts with 'A'?

In [15]:
query_database('SELECT * FROM airlines WHERE carrier LIKE "A%"')

  carrier                    name
0      AA  American Airlines Inc.
1      AS    Alaska Airlines Inc.

Above example with **=** is exact comparison, while the example with **LIKE** leaves you the option of using ... *wildcards* characters.

What is the *wildcard* character? It is used as the substitution (replacement) for one or multiple characters. We could go into more technical details here, but it is certainly better to show this on few examples.

Let's first go over given alternatives.

| Wildcard | Description|
|------|-----|
| % | Replaces one or more characters. |
| _ | Replaces one character. |

By now you are certainly confused.

Examples!

In [16]:
query_database('SELECT * FROM airlines WHERE name LIKE "Air%"')

  carrier                         name
0      FL  AirTran Airways Corporation

What is happening here? Query fetches only rows for which value of *name* column **starts with 'Air'**. `%` specifies that we do not care what goes after 'Air' i.e. all strings that start with 'Air' pass this condition (Air**Tran**, Air**lines**, Air**ways**, etc.).

But how come we did not retrieve more rows? Well, by specifying `Air%` we only get rows where *name* string starts with **Air**.

If we want to retrieve rows where *name* contains **Air** we should do it like in next example:

In [17]:
query_database('SELECT * FROM airlines WHERE name LIKE "%Air%"')

# Pandas way
# df_airlines[df_airlines.name.str.contains('Air')]

   carrier                         name
0       9E            Endeavor Air Inc.
1       AA       American Airlines Inc.
2       AS         Alaska Airlines Inc.
3       B6              JetBlue Airways
4       DL         Delta Air Lines Inc.
5       EV     ExpressJet Airlines Inc.
6       F9       Frontier Airlines Inc.
7       FL  AirTran Airways Corporation
8       HA       Hawaiian Airlines Inc.
9       MQ                    Envoy Air
10      OO        SkyWest Airlines Inc.
11      UA        United Air Lines Inc.
12      US              US Airways Inc.
13      WN       Southwest Airlines Co.
14      YV           Mesa Airlines Inc.

What if we want to retrieve rows where *name* contains separate word **Air**?

In [18]:
query_database('SELECT * FROM airlines WHERE name LIKE "% Air %"')

# Pandas way
# df_airlines[df_airlines.name.str.contains(' Air ')]

  carrier                   name
0      9E      Endeavor Air Inc.
1      DL   Delta Air Lines Inc.
2      UA  United Air Lines Inc.

What if we want to make another condition and take rows where *name* contains separate word **Air** and separate word **Inc.**?

In [19]:
query_database('SELECT * FROM airlines WHERE name LIKE "% Air %" AND name LIKE "% Inc.%"')

  carrier                   name
0      9E      Endeavor Air Inc.
1      DL   Delta Air Lines Inc.
2      UA  United Air Lines Inc.

String matching is not case sensitive. 'a' == 'A'. Pay attention to this.

In [20]:
query_database('SELECT * FROM airlines WHERE carrier = "aa"')

  carrier                    name
0      AA  American Airlines Inc.

In [21]:
query_database('SELECT * FROM airlines WHERE carrier LIKE "_a"')

  carrier                    name
0      AA  American Airlines Inc.
1      HA  Hawaiian Airlines Inc.
2      UA   United Air Lines Inc.

In [22]:
query_database('SELECT * FROM airlines WHERE carrier LIKE "a_"')

  carrier                    name
0      AA  American Airlines Inc.
1      AS    Alaska Airlines Inc.

What if we want to filter out based on `LIKE` condition, instead of selecting?

We use **NOT** keyword i.e. **NOT LIKE** instead of **LIKE**.

In [23]:
query_database('SELECT * FROM airlines WHERE carrier NOT LIKE "a_"')

   carrier                         name
0       9E            Endeavor Air Inc.
1       B6              JetBlue Airways
2       DL         Delta Air Lines Inc.
3       EV     ExpressJet Airlines Inc.
4       F9       Frontier Airlines Inc.
5       FL  AirTran Airways Corporation
6       HA       Hawaiian Airlines Inc.
7       MQ                    Envoy Air
8       OO        SkyWest Airlines Inc.
9       UA        United Air Lines Inc.
10      US              US Airways Inc.
11      VX               Virgin America
12      WN       Southwest Airlines Co.
13      YV           Mesa Airlines Inc.

In [24]:
query_database('SELECT * FROM airlines WHERE carrier NOT LIKE "a_" AND name NOT LIKE "%Inc."')

  carrier                         name
0      B6              JetBlue Airways
1      FL  AirTran Airways Corporation
2      MQ                    Envoy Air
3      VX               Virgin America
4      WN       Southwest Airlines Co.

Surely, this is getting harder to read and can get really painful if you keep adding more keywords into SQL query string. 

Let's try writing SQL queries for easier reading.

In [25]:
query_string = '''
SELECT * FROM airlines 
WHERE carrier NOT LIKE "a_" 
  AND name NOT LIKE "%Inc."
'''

query_database(query_string)

  carrier                         name
0      B6              JetBlue Airways
1      FL  AirTran Airways Corporation
2      MQ                    Envoy Air
3      VX               Virgin America
4      WN       Southwest Airlines Co.

Some of the examples do not have Pandas way, but we encourage you to try it in Pandas and develop your Pandas skills along the way.

Let's switch table.

In [26]:
query_database('SELECT * FROM weather')

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,EWR,2013,1,1,1,39.02,26.06,59.37,270.0,10.35702,NaN,0.0,1012.0,10.0,2013-01-01 01:00:00
1,EWR,2013,1,1,2,39.02,26.96,61.63,250.0,8.05546,NaN,0.0,1012.3,10.0,2013-01-01 02:00:00
2,EWR,2013,1,1,3,39.02,28.04,64.43,240.0,11.50780,NaN,0.0,1012.5,10.0,2013-01-01 03:00:00
3,EWR,2013,1,1,4,39.92,28.04,62.21,250.0,12.65858,NaN,0.0,1012.2,10.0,2013-01-01 04:00:00
4,EWR,2013,1,1,5,39.02,28.04,64.43,260.0,12.65858,NaN,0.0,1011.9,10.0,2013-01-01 05:00:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
26110,LGA,2013,12,30,14,35.96,19.94,51.78,340.0,13.80936,21.86482,0.0,1017.1,10.0,2013-12-30 14:00:00
26111,LGA,2013,12,30,15,33.98,17.06,49.51,330.0,17.26170,21.86482,0.0,1018.8,10.0,2013-12-30 15:00:00
26112,LGA,2013,12,30,16,32.00,15.08,49.19,340.0,14.96014,23.01560,0.0,1019.5,10.0,2013-12-30 16:00:00
26113,LGA,2013,12,30,17,30.92,12.92,46.74,320.0,17.26170,NaN,0.0,1019.9,10.0,2013-12-30 17:00:00
26114,LGA,2013,12,30,18,28.94,10.94,46.41,330.0,18.41248,NaN,0.0,1020.9,10.0,2013-12-30 18:00:00

Oh, first thing that stands out are *NaN* values. But how do we filter these out?

In [27]:
query_string = '''
SELECT * FROM weather
 WHERE wind_gust IS NOT NULL
'''

query_database(query_string)

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,EWR,2013,1,1,16,37.04,19.94,49.62,300.0,13.80936,20.71404,0.0,1012.1,10.0,2013-01-01 16:00:00
1,EWR,2013,1,1,18,33.98,15.08,45.43,310.0,12.65858,25.31716,0.0,1014.1,10.0,2013-01-01 18:00:00
2,EWR,2013,1,1,21,30.02,12.92,48.48,320.0,18.41248,26.46794,0.0,1016.0,10.0,2013-01-01 21:00:00
3,EWR,2013,1,1,22,28.94,12.02,48.69,320.0,18.41248,25.31716,0.0,1016.5,10.0,2013-01-01 22:00:00
4,EWR,2013,1,2,0,26.96,10.94,50.34,310.0,14.96014,25.31716,0.0,1016.3,10.0,2013-01-02 00:00:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5332,LGA,2013,12,30,12,37.94,23.00,54.51,330.0,21.86482,27.61872,0.0,1015.7,10.0,2013-12-30 12:00:00
5333,LGA,2013,12,30,13,37.04,21.92,53.97,340.0,17.26170,20.71404,0.0,1016.5,10.0,2013-12-30 13:00:00
5334,LGA,2013,12,30,14,35.96,19.94,51.78,340.0,13.80936,21.86482,0.0,1017.1,10.0,2013-12-30 14:00:00
5335,LGA,2013,12,30,15,33.98,17.06,49.51,330.0,17.26170,21.86482,0.0,1018.8,10.0,2013-12-30 15:00:00
5336,LGA,2013,12,30,16,32.00,15.08,49.19,340.0,14.96014,23.01560,0.0,1019.5,10.0,2013-12-30 16:00:00

Do you want to know the number of rows that contain *NaN* value in *wind_gust*?

In [28]:
query_string = '''
SELECT count(*) as num_nulls 
  FROM weather
 WHERE wind_gust IS NULL
'''

query_database(query_string)

   num_nulls
0      20778

Nice!

Yeah, you must be thinking we should go straight to the 'relational' part and start joining tables. We will get to there. But first, let's play a little with simpler queries.

When we talk about SQL there is one standard that specifies strict syntax rules, keywords that must be implemented, and there are supported wildcards, functions, procedures and so on. However, each RDBMS implements it's own SQL dialect. In that sense, even MariaDB is not fully compatibile with SQL standard, and SQL written for other database system e.g. Oracle, may not work on MariaDB out of the box. Have that in mind when searching through the documentation and Internet.

Let's look at the `weather` data set.

In [29]:
df_weather.head()

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
1,EWR,2013,1,1,1,39.02,26.06,59.37,270.0,10.35702,NaN,0.0,1012.0,10.0,2013-01-01 01:00:00
2,EWR,2013,1,1,2,39.02,26.96,61.63,250.0,8.05546,NaN,0.0,1012.3,10.0,2013-01-01 02:00:00
3,EWR,2013,1,1,3,39.02,28.04,64.43,240.0,11.50780,NaN,0.0,1012.5,10.0,2013-01-01 03:00:00
4,EWR,2013,1,1,4,39.92,28.04,62.21,250.0,12.65858,NaN,0.0,1012.2,10.0,2013-01-01 04:00:00
5,EWR,2013,1,1,5,39.02,28.04,64.43,260.0,12.65858,NaN,0.0,1011.9,10.0,2013-01-01 05:00:00

Interestingly enough, we just called `head()` method, and did not show how to achieve similar result with SQL.

It is by using `LIMIT` keyword.

Now, reasons why you would like to use `LIKE` are probably not quite the same as the reasons for using `head()` on Pandas DataFrame.

You see, the chances of having Pandas DataFrame with millions of rows are slim. Even then, DataFrame is displayed is displayed by showing first dozen and last dozen of rows. 

When querying database system, you have to be careful with trying to retrieve all rows. If you do not put a limit on your qeury response, you will try to fetch all rows. This can be time consuming or very costly, depending on the database, hosting, etc. 

So, in the phases of exploring the data, before you are 100% sure of what you are doing, use `LIMIT`. Always. 

We will not use it in this session, since dimension of the largest database is not that big.

In [30]:
query_database('SELECT * FROM weather LIMIT 5')

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,EWR,2013,1,1,1,39.02,26.06,59.37,270.0,10.35702,None,0.0,1012.0,10.0,2013-01-01 01:00:00
1,EWR,2013,1,1,2,39.02,26.96,61.63,250.0,8.05546,None,0.0,1012.3,10.0,2013-01-01 02:00:00
2,EWR,2013,1,1,3,39.02,28.04,64.43,240.0,11.50780,None,0.0,1012.5,10.0,2013-01-01 03:00:00
3,EWR,2013,1,1,4,39.92,28.04,62.21,250.0,12.65858,None,0.0,1012.2,10.0,2013-01-01 04:00:00
4,EWR,2013,1,1,5,39.02,28.04,64.43,260.0,12.65858,None,0.0,1011.9,10.0,2013-01-01 05:00:00

In [31]:
query_database('SELECT * FROM weather ORDER BY origin DESC LIMIT 5')

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,LGA,2013,1,1,1,39.92,26.06,57.33,260.0,13.80936,23.01560,0.0,1011.9,10.0,2013-01-01 01:00:00
1,LGA,2013,1,1,2,41.00,26.06,54.97,260.0,17.26170,25.31716,0.0,1011.5,10.0,2013-01-01 02:00:00
2,LGA,2013,1,1,3,41.00,26.06,54.97,260.0,16.11092,24.16638,0.0,1012.0,10.0,2013-01-01 03:00:00
3,LGA,2013,1,1,4,41.00,26.06,54.97,260.0,17.26170,25.31716,0.0,1011.8,10.0,2013-01-01 04:00:00
4,LGA,2013,1,1,5,39.92,24.98,54.81,250.0,14.96014,21.86482,0.0,1011.4,10.0,2013-01-01 05:00:00

This example shows when `LIMIT` keyword is "executed". 

You may believe that we first take 5 first rows, and then do the sort. However, this is not the case. Executing `LIMIT` comes at the end, when the data is sorted.

Okay, let's retrieve only temperature column from the *weather* table. But! Let's retrieve it as integer. 

RDBMS implement various functions that you can call. One of these is `CAST` for casting. Think of casting as coverting.

In [32]:
query_string = '''
SELECT CAST(temp AS INT)
  FROM weather
'''

query_database(query_string)

       CAST(temp AS INT)
0                   39.0
1                   39.0
2                   39.0
3                   40.0
4                   39.0
...                  ...
26110               36.0
26111               34.0
26112               32.0
26113               31.0
26114               29.0

[26115 rows x 1 columns]

In [33]:
query_string = '''
SELECT *, 
       dayname(date(time_hour)) as day_name, 
       monthname(date(time_hour)) as month_name
  FROM weather
 WHERE week(date(time_hour)) = 2
'''

query_database(query_string)

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour,day_name,month_name
0,EWR,2013,1,13,0,46.40,44.96,100.00,160.0,4.60312,NaN,0.0,NaN,0.25,2013-01-13 00:00:00,Sunday,January
1,EWR,2013,1,13,1,44.96,44.96,100.00,0.0,0.00000,NaN,0.0,1020.5,0.25,2013-01-13 01:00:00,Sunday,January
2,EWR,2013,1,13,2,44.96,44.96,100.00,150.0,4.60312,NaN,0.0,NaN,0.25,2013-01-13 02:00:00,Sunday,January
3,EWR,2013,1,13,3,44.96,44.96,100.00,200.0,5.75390,NaN,0.0,NaN,0.25,2013-01-13 03:00:00,Sunday,January
4,EWR,2013,1,13,4,44.60,44.60,100.00,210.0,5.75390,NaN,0.0,NaN,0.25,2013-01-13 04:00:00,Sunday,January
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
499,LGA,2013,1,19,19,48.02,24.98,40.22,200.0,16.11092,26.46794,0.0,1016.7,10.00,2013-01-19 19:00:00,Saturday,January
500,LGA,2013,1,19,20,46.94,24.98,41.89,210.0,16.11092,NaN,0.0,1016.0,10.00,2013-01-19 20:00:00,Saturday,January
501,LGA,2013,1,19,21,46.04,24.98,43.34,210.0,14.96014,NaN,0.0,1015.3,10.00,2013-01-19 21:00:00,Saturday,January
502,LGA,2013,1,19,22,46.04,24.98,43.34,210.0,13.80936,23.01560,0.0,1014.4,10.00,2013-01-19 22:00:00,Saturday,January
503,LGA,2013,1,19,23,44.96,26.06,47.23,210.0,11.50780,NaN,0.0,1013.4,10.00,2013-01-19 23:00:00,Saturday,January

### A highly recommended To Do
- Watch [Complete Python Pandas Data Science Tutorial! (Reading CSV/Excel files, Sorting, Filtering, Groupby)](https://www.youtube.com/watch?v=vmEHCJofslg)
- Watch [Python NumPy Tutorial for Beginners](https://www.youtube.com/watch?v=QUT1VHiLmmI)
- Read chapter [Introduction to NumPy](https://jakevdp.github.io/PythonDataScienceHandbook/02.00-introduction-to-numpy.html) from [Python Data Science Handbook, Jake VanderPlas](https://jakevdp.github.io/PythonDataScienceHandbook/)

<hr>

DataKolektiv, 2022/23.

[hello@datakolektiv.com](mailto:goran.milovanovic@datakolektiv.com)

![](../img/DK_Logo_100.png)

<font size=1>License: [GPLv3](https://www.gnu.org/licenses/gpl-3.0.txt) This Notebook is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This Notebook is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this Notebook. If not, see http://www.gnu.org/licenses/.</font>